src/data/serverStatusBody.xml

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
    <soap12:Body>
        <GetDatacenterStatus xmlns="http://www.turbine.com/SE/GLS">
            <game>DDO</game>
        </GetDatacenterStatus>
    </soap12:Body>
</soap12:Envelope>
